import time


def logo_menu():
    builded_menu = r"""  
 _____                                                                                                                _____ 
( ___ )                                                                                                              ( ___ )
 |   |~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|   | 
 |   |                                                                                                                |   | 
 |   |  ________________ _______ _________________       _______ _          _______         _______ ________________  |   | 
 |   |  \__   __(  ____ (  ____ (       \__   __( (    /(  ___  ( \        (  ___  |\     /(  ____ (  ____ \__   __/  |   | 
 |   |     ) (  | (    \| (    )| () () |  ) (  |  \  ( | (   ) | (        | (   ) | )   ( | (    \| (    \/  ) (     |   | 
 |   |     | |  | (__   | (____)| || || |  | |  |   \ | | (___) | |        | |   | | |   | | (__   | (_____   | |     |   | 
 |   |     | |  |  __)  |     __| |(_)| |  | |  | (\ \) |  ___  | |        | |   | | |   | |  __)  (_____  )  | |     |   | 
 |   |     | |  | (     | (\ (  | |   | |  | |  | | \   | (   ) | |        | | /\| | |   | | (           ) |  | |     |   | 
 |   |     | |  | (____/| ) \ \_| )   ( ___) (__| )  \  | )   ( | (____/\  | (_\ \ | (___) | (____//\____) |  | |     |   | 
 |   |     )_(  (_______|/   \__|/     \\_______|/    )_|/     \(_______/  (____\/_(_______(_______\_______)  )_(     |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                          Created by cristianadraade                                            |   | 
 |   |                                     https://github.com/cristianandraaade                                       |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |       _   _                       _                                                                            |   |
 |   |      | \ | | _____   _____       | | ___   __ _  ___                                                           |   |
 |   |      |  \| |/ _ \ \ / / _ \   _  | |/ _ \ / _` |/ _ \                                                          |   |
 |   |      | |\  | (_) \ V / (_) | | |_| | (_) | (_| | (_) |                           Press 1                       |   | 
 |   |      |_| \_|\___/ \_/ \___/   \___/ \___/ \__, |\___/                                                          |   |
 |   |                                           |___/                                                                |   |
 |   |                                                                                                                |   |  
 |   |        ___            /\/|                                                                                     |   |
 |   |       / _ \ _ __   ___|/\/   ___  ___                                                                          |   |
 |   |      | | | | '_ \ / __/ _ \ / _ \/ __|                                                                         |   |
 |   |      | |_| | |_) | (_| (_) |  __/\__ \                                           Press 2                       |   |
 |   |       \___/| .__/ \___\___/ \___||___/                                                                         |   |
 |   |            |_|     )_)                                                                                         |   | 
 |   |                                                                                                                |   |
 |   |                                                                                                                |   |           
 |   |       ____                                                                                                     |   |
 |   |      / ___|  __ _(_)_ __                                                                                       |   |
 |   |      \___ \ / _` | | '__|                                                        Press 0                       |   |
 |   |       ___) | (_| | | |                                                                                         |   |
 |   |      |____/ \__,_|_|_|                                                                                         |   |                                        
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |   |                                                                                                                |   | 
 |___|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|___| 
(_____)                                                                                                              (_____)"""
    print(builded_menu)
    print()
    print()


def initial_history():
    intro = [
        "No coração de um mundo esquecido, onde reis e magos travaram batalhas há muito tempo,",
        "restam apenas ruínas... e mistérios.\n",
        "Você desperta em meio à escuridão, sem lembrar como chegou ali.",
        "A única pista é uma antiga inscrição gravada na pedra:\n",
        "\"Aquele que dominar a Força do Terminal será o guardião do equilíbrio... ou o seu destruidor.\"\n",
        "Diante de você, um caminho se abre.",
        "Criaturas sombrias guardam os segredos desse lugar.",
        "Sua jornada está prestes a começar...\n"
    ]

    for linha in intro:
        print(linha)
        time.sleep(1.5)
